//----------------------------------------------------------------------------------------------------------------------
///
/// \file       units.h
/// \brief      Единицы измерения физических величин, форматы чисел
/// \date       17.02.20 - создан
/// \author     Соболев А.А.
/// \addtogroup spml
/// \{
///

#ifndef SPML_UNITS_H
#define SPML_UNITS_H

namespace SPML /// Библиотека СБПМ
{
namespace Units /// Единицы измерения физических величин, форматы чисел
{
//----------------------------------------------------------------------------------------------------------------------
///
/// \brief Формат числа
///
enum TNumberFormat
{
    NF_Fixed,       ///< Отображение фиксированного числа знаков после запятой
    NF_Scientific   ///< Отображение в научном формате 1e+000
};

///
/// \brief Размерность угловых единиц
///
enum TAngleUnit
{
    AU_Radian,  ///< Радиан
    AU_Degree   ///< Градус
};

///
/// \brief Размерность единиц дальности
///
enum TRangeUnit
{
    RU_Meter,       ///< Метр
    RU_Kilometer    ///< Километр
};

}
}
#endif // SPML_UNITS_H
/// \}
